tap "homebrew/cask"
tap "github/gh"
cask_args appdir: "/Applications"

brew "asdf"
brew "awscli@2"
brew "autojump"
brew "bat"
brew "brew-cask-completion"
brew "eslint"
brew "fzf"
brew "git"
brew "git-delta"
brew "gh"
brew "httpie"
brew "openssl"
brew "prettier"
brew "watch"
brew "zplug"
brew "zsh"
brew "zsh-completions"

cask "docker"
cask "cask-fonts/font-fira-code"
cask "github"
cask "visual-studio-code"

mas "CopyClip", id: 595191960
# mas "Xcode", id: 497799835 # requires update on new machine to latest id
